app/controllers/books_controller.rb

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."book_id" = ? AND "bookmarks"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 2], ["LIMIT", 1]]
---
  def show
    @reviews = @book.reviews
    @bookmark = @book.bookmarks.find_by(user_id: current_user.id) if current_user

INSERT INTO "books" ("title", "author", "public_year", "user_id", "created_at", "updated_at", "cover", "status", "synopsis", "link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save

UPDATE "books" SET "synopsis" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["synopsis", "hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh"], ["updated_at", "2019-12-28 08:59:00.398311"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "accepted"], ["updated_at", "2019-12-28 09:04:01.106874"], ["id", 2]]
INSERT INTO "notifications" ("user_id", "notified_by_id", "notice_type", "book_id", "request_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def accept_request
    if @book.update(book_params)
      Notification.create user: @book.user, notified_by: current_user,
        notice_type: 'BOOK_REQUEST', book: @book, request_status: 'ACCEPTED',
        is_read: false

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
---
  def destroy
    @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])