app/controllers/bookmarks_controller.rb

SELECT "bookmarks"."book_id" FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 2]]
---
  def index
    book_ids = current_user.bookmarks.pluck(:book_id)

INSERT INTO "bookmarks" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 1], ["created_at", "2019-12-28 08:58:44.768587"], ["updated_at", "2019-12-28 08:58:44.768587"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)
    if @bookmark.save

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
---
  def destroy
    bookmark = Bookmark.find_by(id: params[:id])
    bookmark.destroy