app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "manga"], ["created_at", "2019-12-28 09:49:20.218753"], ["updated_at", "2019-12-28 09:49:20.218753"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM "book_categories" WHERE "book_categories"."id" = ?  [["id", 4]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
---
  def destroy
    @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "book_categories".* FROM "book_categories" WHERE "book_categories"."category_id" = ?  [["category_id", 3]]
---
    def set_category
      @category = Category.find(params[:id])