app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "book_id", "user_id", "created_at", "updated_at", "rating") VALUES (?, ?, ?, ?, ?, ?)  [["content", "meo dep"], ["book_id", 2], ["user_id", 3], ["created_at", "2019-12-28 09:31:28.166526"], ["updated_at", "2019-12-28 09:31:28.166526"], ["rating", 4]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review.destroy

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_review
      @review = Review.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_book
      @book = Book.find_by id: params[:book_id]